saleor/payment/gateways/authorize_net/tests/cassettes/test_authorize_net/test_payment_gateway_process_payment_production_failure.yaml

interactions:
- request:
    body: <?xml version="1.0" encoding="utf-8"?><createTransactionRequest xmlns="AnetApi/xml/v1/schema/AnetApiSchema.xsd"><merchantAuthentication><name>public</name><transactionKey>secret</transactionKey></merchantAuthentication><clientId>sdk-python-1.1.3</clientId><refId>295</refId><transactionRequest><transactionType>authCaptureTransaction</transactionType><amount>10.0</amount><currencyCode>USD</currencyCode><payment><opaqueData><dataDescriptor>COMMON.ACCEPT.INAPP.PAYMENT</dataDescriptor><dataValue>a</dataValue></opaqueData></payment><order><description></description></order><customer><type>individual</type><email>example@test.com</email></customer></transactionRequest></createTransactionRequest>
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '697'
      Content-Type:
      - application/xml
      User-Agent:
      - python-requests/2.25.0
      encoding:
      - utf-8
      version:
      - '1.0'
    method: POST
    uri: https://api2.authorize.net/xml/v1/request.api
  response:
    body:
      string: "\uFEFF<?xml version=\"1.0\" encoding=\"utf-8\"?><createTransactionResponse\
        \ xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\
        \ xmlns=\"AnetApi/xml/v1/schema/AnetApiSchema.xsd\"><refId>295</refId><messages><resultCode>Error</resultCode><message><code>E00007</code><text>User\
        \ authentication failed due to invalid authentication values.</text></message></messages><transactionResponse\
        \ /></createTransactionResponse>"
    headers:
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Headers:
      - x-requested-with,cache-control,content-type,origin,method,SOAPAction
      Access-Control-Allow-Methods:
      - PUT,OPTIONS,POST,GET
      Access-Control-Allow-Origin:
      - '*'
      Cache-Control:
      - no-store
      Content-Length:
      - '450'
      Content-Type:
      - application/xml; charset=utf-8
      Date:
      - Tue, 15 Dec 2020 19:23:02 GMT
      Pragma:
      - no-cache
      Strict-Transport-Security:
      - max-age=31536000
      X-Cnection:
      - close
      X-OPNET-Transaction-Trace:
      - a2_1a9b7ff9-4819-4b1b-ab05-09c2bc22785f-13476-279180052
    status:
      code: 200
      message: OK
version: 1
